In [21]:
import pandas as pd

In [22]:
data = {'Name' : ['kannan','soman','shekaran'],
        'Age' : [23,12,34],
         'City' : ['Banglore','Pune','kolkata'] }

In [23]:
df = pd.DataFrame(data)

In [24]:
df['Marks'] = [95,35,100]

In [25]:
df['Name'][2] = 'Sonu'
df

C:\Users\91859\AppData\Local\Temp\ipykernel_22868\2449074182.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][2] = 'Sonu'
C:\Users\91859\AppData\Local\Temp\ipykernel_22868\2449074182.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = 'Sonu'

     Name  Age      City  Marks
0  kannan   23  Banglore     95
1   soman   12      Pune     35
2    Sonu   34   kolkata    100

In [26]:
df.loc[2,'Name'] = 'Somu'
df

     Name  Age      City  Marks
0  kannan   23  Banglore     95
1   soman   12      Pune     35
2    Somu   34   kolkata    100

In [27]:
# ⿡ Series from List
# ------------------------------------------------------------
# Create a Pandas Series from the list [5, 10, 15, 20, 25]
# - Display the third element using both iloc and loc
# - Display all elements greater than 10

l = [5,10,15,20,25]

aa = pd.Series(l,index=[10,11,12,13,14])

print(aa.iloc[2])
print(aa.loc[12])

aa[aa>10]

15
15

12    15
13    20
14    25
dtype: int64

In [28]:

# ⿢ DataFrame Creation
# ------------------------------------------------------------
# Create a DataFrame using:
# {
#   'Name': ['Riya', 'Amit', 'Sara', 'John'],
#   'Age': [22, 25, 24, 28],
#   'City': ['Delhi', 'Mumbai', 'Chennai', 'Delhi']
# }
# - Display only the columns Name and City
# - Display the first two rows only


l1 = {
    'Name': ['Riya', 'Amit', 'Sara', 'John'],
    'Age': [22, 25, 24, 28],
    'City': ['Delhi', 'Mumbai', 'Chennai', 'Delhi']
}

ab = pd.DataFrame(l1)
print(ab[["Name",'City']])
ab.head(2)

   Name     City
0  Riya    Delhi
1  Amit   Mumbai
2  Sara  Chennai
3  John    Delhi

   Name  Age    City
0  Riya   22   Delhi
1  Amit   25  Mumbai

In [29]:

# ⿣ Conditional Filtering
# ------------------------------------------------------------
# From the above DataFrame:
# - Display rows where Age > 23
# - Display rows where City == 'Delhi' and Age > 23

print(ab[ab['Age']>23])

ab[(ab["City"] == "Delhi") & (ab["Age"] > 23)]

   Name  Age     City
1  Amit   25   Mumbai
2  Sara   24  Chennai
3  John   28    Delhi

   Name  Age   City
3  John   28  Delhi

In [30]:
# ⿤ Add and Modify Columns
# ------------------------------------------------------------
# Add a new column "Marks" = [85, 92, 78, 88]
# Change the Name in the 3rd row (index 2) to 'Rahul'


ab["Marks"] = [85,92,78,88]
ab.loc[2,"Name"] = 'Rahul'
ab

    Name  Age     City  Marks
0   Riya   22    Delhi     85
1   Amit   25   Mumbai     92
2  Rahul   24  Chennai     78
3   John   28    Delhi     88

In [31]:

# ⿥ Drop / Rename Columns
# ------------------------------------------------------------
# Drop the column "City"
# Rename the column "Marks" to "Score"

print(ab.drop(columns="City"))
ab.rename(columns={"Marks":"Score"},inplace=0)

    Name  Age  Marks
0   Riya   22     85
1   Amit   25     92
2  Rahul   24     78
3   John   28     88

    Name  Age     City  Score
0   Riya   22    Delhi     85
1   Amit   25   Mumbai     92
2  Rahul   24  Chennai     78
3   John   28    Delhi     88

In [32]:
# ⿦ Handling Missing Values
# ------------------------------------------------------------
# Create a DataFrame:
# {
#   'Name': ['Amit', 'Riya', 'Sara', None],
#   'Age': [25, None, 22, 30]
# }
# - Count the number of missing values per column
# - Replace missing values in 'Age' with the mean age

In [33]:
l3 = {
    'Name': ['Amit', 'Riya', 'Sara', None],
    'Age': [25, None, 22, 30]
}
ac = pd.DataFrame(l3)
ac

   Name   Age
0  Amit  25.0
1  Riya   NaN
2  Sara  22.0
3  None  30.0

In [34]:
print(ac.dropna().value_counts())
ac.fillna({"Age":ac["Age"].mean()},inplace=False)

Name  Age
Amit  25.0    1
Sara  22.0    1
Name: count, dtype: int64

   Name        Age
0  Amit  25.000000
1  Riya  25.666667
2  Sara  22.000000
3  None  30.000000

In [35]:
# ⿧ Sorting
# ------------------------------------------------------------
# Using this data:
# {
#   'Name': ['Riya', 'Amit', 'Sara', 'John'],
#   'Marks': [85, 92, 78, 88]
# }
# - Sort the DataFrame by Marks (ascending)
# - Then sort again by Marks (descending)


l4 = {
    'Name': ['Riya', 'Amit', 'Sara', 'John'],
    'Marks': [85, 92, 78, 88]
}

ad = pd.DataFrame(l4)

print(ad.sort_values("Marks",ascending=True))

ad.sort_values("Marks",ascending=False)

   Name  Marks
2  Sara     78
0  Riya     85
3  John     88
1  Amit     92

   Name  Marks
1  Amit     92
3  John     88
0  Riya     85
2  Sara     78

In [36]:
# ⿨ Grouping & Aggregation
# ------------------------------------------------------------
# {
#   'City': ['Delhi', 'Delhi', 'Chennai', 'Mumbai', 'Mumbai'],
#   'Marks': [80, 90, 70, 85, 95]
# }
# - Find average Marks per City
# - Find maximum Marks per City

l5 ={
    'City': ['Delhi', 'Delhi', 'Chennai', 'Mumbai', 'Mumbai'],
    'Marks': [80, 90, 70, 85, 95]
}

ae = pd.DataFrame(l5)

print(ae.groupby("City")["Marks"].mean())
print(ae.groupby("City")["Marks"].max())

City
Chennai    70.0
Delhi      85.0
Mumbai     90.0
Name: Marks, dtype: float64
City
Chennai    70
Delhi      90
Mumbai     95
Name: Marks, dtype: int64

In [55]:
new_row = pd.DataFrame([
    {'Name' : 'soman' , 'Age' : 20 , 'Marks' : 12},
    {'Name' : "chinnu" , 'Age' : 12 , 'Marks' : 32}

])

df = pd.concat([df,new_row],ignore_index=True)
df

     Name  Age      City  Marks
0  kannan   23  Banglore     95
1   soman   12      Pune     35
2    Somu   34   kolkata    100
3   Kumar   20       NaN     12
4  chinnu   12       NaN     32
5   soman   20       NaN     12
6  chinnu   12       NaN     32

In [40]:
df[['Name',"Marks"]]

     Name  Marks
0  kannan     95
1   soman     35
2    Somu    100
3   Kumar     12
4  chinnu     32

In [41]:
df.loc[2,['Name','Marks']]

Name     Somu
Marks     100
Name: 2, dtype: object

In [58]:
df.loc[0:4:2,['Name','Marks']]

     Name  Marks
0  kannan     95
2    Somu    100
4  chinnu     32

In [51]:
df.iloc[0:4,0:3]

     Name  Age      City
0  kannan   23  Banglore
1   soman   12      Pune
2    Somu   34   kolkata
3   Kumar   20       NaN

In [56]:
gr = df.groupby('Name')
gr['Marks'].mean()

Name
Kumar      12.0
Somu      100.0
chinnu     32.0
kannan     95.0
soman      23.5
Name: Marks, dtype: float64